/**
*****************************************************************************
*  Copyright (C), 仅供实验室内部使用，未经许可禁止外传
*
*  @file    common.cpp
*  @brief   常量定义
*           1.早期为了规范定义变量，后面没有继续规范，该文件在绘图文件中使用，误删！！！
*
*  @author  kdh
*  @date    2024-05-20
*  @version V1.1.1 2024-05-20
*  @advice  尽量不要将各个功能都在同一文件中实现
*           文件解耦会极大提高工程可扩展性、可测试性,保证软件效率和质量
*----------------------------------------------------------------------------
*  @note 历史版本     修改人员        修改日期        修改内容
*  @note v1.0.0      kdh           2023-12-20     创建
*  @note v1.1.0      kdh           2024-05-08     完成基本功能
*****************************************************************************
**/
#include "common.h"

double DOTS_PER_MM = 5.0;
